/*
 * Логічні оператори (&& || !)
 */

//* && - запинається на брехні
//* Якщо операнд був преведенний до false, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до true, то повертається значення останнього операнду.
// const result = 'Hello' && 10 && 20 && 0 && 'Hi';

// console.log(result);

//* || - запинається на правді
//* Якщо операнд був преведенний до true, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до false, то повертається останній.
// const result = 'Hello' || 10 || 20 || 0 || 'Hi';

// console.log(result);

// const userName = prompt('Введіть ваше імʼя') || 'anonymus';

// console.log(userName);

//* ! - інвертує правду до брехні, а брехню до правди
const flag = !'Hello';

console.log(flag);
